{"id":934,"date":"2023-01-02T16:54:31","date_gmt":"2023-01-02T11:24:31","guid":{"rendered":"https:\/\/vinayaroratech.com\/?p=934"},"modified":"2023-01-02T16:54:33","modified_gmt":"2023-01-02T11:24:33","slug":"how-to-handle-datetime-in-cosmos-db","status":"publish","type":"post","link":"https:\/\/vinayaroratech.com\/dotnet\/how-to-handle-datetime-in-cosmos-db\/","title":{"rendered":"How to Handle DateTime in Cosmos DB"},"content":{"rendered":"\n<p>DateTime data type can be trouble. In SQL Server, there are many datetime datatypes. Some of them are in UTC format, some of them has time zone information, some of them is just basic date and time or just date. Depending on what you need, you can pick one of them and hopefully you pick the right one for what you need.<\/p>\n\n\n\n<p>What if you want to store datetime in a database and there is no datetime data type available? If you use NoSQL Database like Cosmos DB, you will have this problem. Data is saved as Json in Cosmos DB and other NoSQL Databases. JSON does not have a data type. Json supports only strings, numbers, Boolean, null, custom objects and arrays.<\/p>\n\n\n\n<p>Things can get tricky if you have queries that need to retrieve data by date. Since there is no date type, how can database engine compare date to date? I am not sure how Cosmos DB handles this problem internally but my guess the answer for this question is just like any database answer…. It depends 😊 <\/p>\n\n\n\n<p>I believe it depends on how you save the datetime information in the database. There are many ways to save date and time, the default way is, It will be saved as string but you can also save it as a number. Date format depends on how you serialize your data into JSON.<\/p>\n\n\n\n<p>Let’s say the date we want to save is <strong>11\/15\/2019 01:58 PM<\/strong> and we are in <strong>Eastern Time Zone<\/strong>. Here are the most common serializer outputs. <br><strong>.NET JavaScriptSerializer<\/strong>.                             <strong>&#8220;\\&#8221;\\\\\/Date(1573844334736)\\\\\/\\&#8221;&#8221;<\/strong><\/p>\n\n\n\n<p><strong>.NET DataContractJsonSerializer.                &#8220;\\&#8221;\\\\\/Date(1573844334736-0500)\\\\\/\\&#8221;<\/strong><\/p>\n\n\n\n<p><strong>&#8220;Built-in JSON object of JavaScript.           &#8220;2019-11-15T13:58:00.511Z&#8221;     <\/strong><\/p>\n\n\n\n<p><strong>ISO 8601 Format                                           &#8220;2019-11-15T13:58:00-05:00&#8221;<br><\/strong>One of the most common and recommended versions of datetime in many systems is <strong>ISO 8601<\/strong> format. This is the format Cosmos DB recommends too. Also; It is recommended to store all dates as UTC. It is recommended because it is readable, data sorts correctly, includes fractional seconds and it is endorsed by many groups including W3C.<\/p>\n\n\n\n<p>As you can see it does not matter which serializer you pick your datetime will be a string. In some way database engine needs to know that this string is datetime and use it as datetime to retrieve data. If this happens in SQL Server, you are looking at table scan because you need to convert all the data into the datetime data type then try to compare data. We are not even touching to potential Time Zone or elapsed seconds problems.<\/p>\n\n\n\n<p>You can save datetime as a number too. As you can see in the first two serializers, there is a number in the Date constructor. This number is known as Unix timestamp. It represents the total number of seconds that have elapsed since January 1, 1970. It does not count leap seconds! Cosmos DB’s Timestamp (<strong>_ts<\/strong>) follows this way.<\/p>\n\n\n\n<p>It’s easy to convert datetime into Unix timestamp in JavaScript. Since Cosmos DB stored procedures are in JavaScript too, you can convert the datetime coming from user into Unix timestamp then search CosmosDB by using a number rather than string. If you need to use SDK to find data, you can use <a href=\"https:\/\/docs.microsoft.com\/en-us\/dotnet\/api\/microsoft.azure.documents.unixdatetimeconverter?redirectedfrom=MSDN&amp;view=azure-dotnet\">UnixDateTimeConverter <\/a>class to convert datetime to Unix timestamp in your code.<\/p>\n\n\n\n<p>To search by Unix timestamp from stored procedure or SDK; First you need to save datetime in Unix timestamp as number. I recommend saving the dates in string format and Unix timestamp format in the database. You can use Unix timestamp to search in database and you can use string format to display date in User Interface so you don’t need to do any conversion in client side or server side. You might need to pay little bit more for storage, but I think it&#8217;s worth it. You can customize the Indexing policy and index only Unix timestamp.<\/p>\n\n\n\n<p>Here is an example, I have the date in ISO 8601 format and Unix Timestamp format in the following document.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/1.bp.blogspot.com\/-AXyj0hbBPrA\/XdCVmcGXOcI\/AAAAAAAACdI\/P1gy4L57PZ0CLjPU0YlRw5fa1hB4b2FTgCLcBGAsYHQ\/s1600\/dt1.PNG\"><img src=\"https:\/\/1.bp.blogspot.com\/-AXyj0hbBPrA\/XdCVmcGXOcI\/AAAAAAAACdI\/P1gy4L57PZ0CLjPU0YlRw5fa1hB4b2FTgCLcBGAsYHQ\/s1600\/dt1.PNG\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<p>I have a container named Posts, It has 100.000 Json documents in it. Let’s say I need to find all the posts of a specific user after a specific date. Since I have the datetime in Unix timestamp. I will use <strong>CreationUnixDt <\/strong>property in my query, It should be faster to find a number than string in any database. Let’s test if this applies to Cosmos DB. First let’s search by <strong>CreationDate <\/strong>property which is a string.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/1.bp.blogspot.com\/-HACSfZCB7QY\/XdCjtZLnKuI\/AAAAAAAACdo\/_RO8Cno85LwjwnSTq1Cx2nuncRtP8aMPgCLcBGAsYHQ\/s1600\/dt2.PNG\"><img src=\"https:\/\/1.bp.blogspot.com\/-HACSfZCB7QY\/XdCjtZLnKuI\/AAAAAAAACdo\/_RO8Cno85LwjwnSTq1Cx2nuncRtP8aMPgCLcBGAsYHQ\/s640\/dt2.PNG\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<p>Now, Let’s use the same query but this time search by Unix Timestamp which is a number. First, we need to convert date (2008-07-01) to Unix Timestamp. There are many ways to do that. For example, In SQL Server you can use the following T-SQL<\/p>\n\n\n\n<p><code>SELECT&nbsp;DATEDIFF(SECOND,{d '1970-01-01'}, '2008-07-1')<\/code><br>This returns&nbsp;<strong>1214870400.&nbsp;<\/strong>Now let&#8217;s use that in the query.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/1.bp.blogspot.com\/-TNtyMIM_gUA\/XdCnGqx1I4I\/AAAAAAAACd8\/-S2X5EIwyXQO9bKmKM9p3taVKE8dQDwygCLcBGAsYHQ\/s1600\/dt3.PNG\"><img src=\"https:\/\/1.bp.blogspot.com\/-TNtyMIM_gUA\/XdCnGqx1I4I\/AAAAAAAACd8\/-S2X5EIwyXQO9bKmKM9p3taVKE8dQDwygCLcBGAsYHQ\/s640\/dt3.PNG\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<p>There are interesting results here, first of all it looks like It costs more to search by a number. Index lookup time is significantly low when you search by a number and execution time is higher when we search by a number. I am surprised about these numbers. If this was done in SQL Server, there will be huge differences between these two queries. Results of these queries tell me that there is not that much difference between these two queries.<\/p>\n\n\n\n<p>You have one more option to save datetime in JSON object. You can create a custom object for it. This might cost you more for storage since you will have more properties to define a date and time. But you can search database however you like since it will give you most flexible solution, you store what it matters for you in this way. If date and time is crucial for your solution, this might help you to store datetime the way you want. You can store the location of user in this custom object too. Sometimes, it&#8217;s not enough to know what time zone user was in when transaction occurred. There are a lot of countries in the same time zone and current datetime data types do not include any information about the location of user.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/1.bp.blogspot.com\/-Mna_O8UEOYA\/XdPfzfdkkvI\/AAAAAAAACeo\/hykSN7ELwWo87LJQCPj_xAtaOUGIw-pcQCLcBGAsYHQ\/s1600\/dt4.PNG\"><img src=\"https:\/\/1.bp.blogspot.com\/-Mna_O8UEOYA\/XdPfzfdkkvI\/AAAAAAAACeo\/hykSN7ELwWo87LJQCPj_xAtaOUGIw-pcQCLcBGAsYHQ\/s640\/dt4.PNG\" alt=\"\"\/><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>DateTime data type can be trouble. In SQL Server, there are many datetime datatypes. Some of them are in UTC format, some of them has time zone information, some of them is just basic date and time or just date. Depending on what you need, you can pick one of them and hopefully you pick &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/vinayaroratech.com\/dotnet\/how-to-handle-datetime-in-cosmos-db\/\"> <span class=\"screen-reader-text\">How to Handle DateTime in Cosmos DB<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,93,13],"tags":[95,8,96,94],"_links":{"self":[{"href":"https:\/\/vinayaroratech.com\/wp-json\/wp\/v2\/posts\/934"}],"collection":[{"href":"https:\/\/vinayaroratech.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/vinayaroratech.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/vinayaroratech.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/vinayaroratech.com\/wp-json\/wp\/v2\/comments?post=934"}],"version-history":[{"count":1,"href":"https:\/\/vinayaroratech.com\/wp-json\/wp\/v2\/posts\/934\/revisions"}],"predecessor-version":[{"id":935,"href":"https:\/\/vinayaroratech.com\/wp-json\/wp\/v2\/posts\/934\/revisions\/935"}],"wp:attachment":[{"href":"https:\/\/vinayaroratech.com\/wp-json\/wp\/v2\/media?parent=934"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/vinayaroratech.com\/wp-json\/wp\/v2\/categories?post=934"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/vinayaroratech.com\/wp-json\/wp\/v2\/tags?post=934"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}